int/resources/objectRepo/xmlTemplates/ows/OWSReservationAdvanced/req_CancelCheckIn.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="http://webservices.micros.com/og/4.3/Common/" xmlns:core="http://webservices.micros.com/og/4.3/Core/" xmlns:hot="http://webservices.micros.com/og/4.3/HotelCommon/" xmlns:res="http://webservices.micros.com/og/4.3/ResvAdvanced/">
   <soapenv:Header>
      <core:OGHeader authToken="?" channelValidation="?" primaryLangID="?" terminalID="?" timeStamp="?" transactionID="?">
         <core:Origin entityID="?" organizationID="?" systemType="?"/>
         <core:Destination entityID="?" organizationID="?" systemType="?"/>
         <core:Intermediaries>
            <core:EndPoint entityID="?" organizationID="?" systemType="?"/>
         </core:Intermediaries>
         <core:Authentication>
            <core:UserCredentials>
               <core:UserName/>
               <core:UserPassword/>
               <core:Domain/>
               <core:SecurityId/>
            </core:UserCredentials>
            <core:Licence>
               <core:Key/>
            </core:Licence>
         </core:Authentication>
      </core:OGHeader>
   </soapenv:Header>
   <soapenv:Body>
      <res:CancelCheckInRequest>
         <res:ReservationRequest>
            <res:HotelReference chainCode="?" hotelCode="?"/>
            <res:KeyTrack Key1Track="?" Key2Track="?" Key3Track="?" Key4Track="?"/>
            <res:ReservationID>
               <com:UniqueID source="?" type="?"/>
            <com:UniqueID source="?" type="?"/></res:ReservationID>
            <res:CheckOutTime/>
         </res:ReservationRequest>
         <res:Printer PrinterEmulation="?" PrinterName="?" StationID="?" UserID="?"/>
         <res:CancelTerm cancelBy="?" cancelDate="?" cancelNumber="?" cancelReasonCode="?" cancelType="?" otherCancelType="?">
            <hot:CancelReason>
               <hot:Image/>
               <hot:URL/>
               <hot:Text formatted="?" language="?"/>
            </hot:CancelReason>
         </res:CancelTerm>
      </res:CancelCheckInRequest>
   </soapenv:Body>
</soapenv:Envelope>